[{"Title":"Sally Li's Personal Portfolio","Description":"Welcome to the home page of Sally Li's personal portfolio for the INFO 343 course. This multi-page website showcases all of Sally's projects for the course. It is a data-driven webpage utilizing the Angular JavaScript library. Click on the links on the navigation bar to view the individual challenges for the course. The table below diplays all of the challenges, dates they were completed, and links to Michael Freeman's original spec for the challenge.","Link":""},
{"Title":"Dawg Coffee","Description":"The Dawg Coffee challenge of the INFO 343 course explores core HTML and CSS concepts. The website provides an example of one of the most common web development projects for organizations or products. It showcases capabilities of working on larger and smaller devices by using media quieries. Also, it demonstrates the skills of writing semantically-rich HTML pages and creating hyperlinks to tie pages together. Numerous CSS units are used to improve the overall design and layout of the webpage.","Link":"http://students.washington.edu/lisally/info343/dawg-coffee/"},
{"Title":"Police Shooting","Description":"The Police Shooting challenge of the INFO 343 course explores interactive map functionalities using the Leaflet javascript library. This website is an example of projects that are used to communicate important information to broad audiences. It showcases the skill of requesting data using an AJAX call to crowd-sourced data from a json file. Also, it displays the practice of data manipulation using JavaScript.","Link":"http://students.washington.edu/lisally/info343/police-shooting/"},
{"Title":"CRUD Reviewer","Description":"The CRUD Web Applicatin challenge of the INFO 343 course explores building a create, read, update, and delete application. The website is an example of projects that uses cloud-based data storage for users to store information. It utilizes the jQuery library to add webpage element dynamically based on the data stored. Also, it uses the data storage, Parse, to store information such as reviews on a specific product.","Link":"http://students.washington.edu/lisally/info343/crud-review/"},
{"Title":"Spotify Sampler","Description":"The Spotify challenge of the INFO 343 course explores building a web application with Angular that accesses data from the Spotify API. It utilizes Angular directives and expressons in HTML. Also, it practices the usage of Angular modules and controllers in JavaScript code. The Spotify API allows for the search functionality on the webpage to access Spotify's large database of music tracks.","Link":"http://students.washington.edu/lisally/info343/spotify-challenge/"}]